#+title: Lab Assignment 2 (Nonlinear algebraic equation)
#+description: Find roots numerically by use of, Newton and Secant methods.
#+PROPERTY: header-args :tangle ./lab2.py 
*** First equation

#+begin_src python :results output :session
def function1(x):
    """ Equation (1) has zero on the right hand side so we let the left hand
    side be the function.
    """
    return x**4 - 5 * x**3 + 9 * x + 3


def function1_derivative(x):
    """ The derivative to function1 with respect to x. """
    return 4 * x**3 - 15 * x**2 + 9


def find_a_root_equation_1(method, debug=False):
    """ Finds a root to the equation x^4 - 5x^3 + 9x + 3 = 0 with the
    method 'Newton' or 'Secant'. """
    if method == "Newton":
        return find_root_newton(function1, function1_derivative,1, 0.001, debug=debug)
    elif method == "Secant":
        return find_root_secant(function1, [4,6], 0.001, debug=debug)
    else:
        raise ValueError(f"<find_a_root_equation_1: '{method}' not a valid method.>")


print(find_a_root_equation_1('Newton', debug=True))
#+end_src

#+RESULTS:
: (4.528917959646293, 5)


*** Newton

#+begin_src python :results output :session
square_root_2 = lambda x: x ** 2 -2
print(find_root_newton(square_root_2, lambda x: 2*x, -10, 0.001, debug=True))
#+end_src

#+RESULTS:
: (-1.4145256551487377, 5)

*** Secant


#+begin_src python :results output :session
print(find_root_secant(square_root_2, [0,2], 0.001, debug=True))
#+end_src

#+RESULTS:
: (1.41421143847487, 5)
